{"pageProps":{"post":{"title":"Random Thoughts On Using Backbone.js For 3 Months","createdAt":"2014-10-11T00:00:00-07:00","categories":["javascript","backbone"],"slug":"random-thoughts-on-using-backbonejs-for-3-months","fullPath":"/home/jason/projects/websites/serv.github.io/_posts/2014-10-11-random-thoughts-on-using-backbone-dot-js-for-3-months.md","content":"<h2>tl;dr</h2>\n<ul>\n<li>Backbone.js is amazing</li>\n<li>Event driven development was a paradigmatic shift.</li>\n<li>Backbone won't stop you from writing bad code.</li>\n<li>Overwhelmed with other tools</li>\n<li>Creating global variables and methods are not straight forward in Backbone.</li>\n</ul>\n<p>Let me preface the entire post by saying, Backbone.js is awesome.\nI've been using Backbone.js for last 3 months at work and doing a side project.\nI can't imagine pulling them off in pure jQuery alone.\nBackbone.js was instrumental in my work.\nIn this post, I am writing briefly about how I felt about using Backone.js and\nsome observations I made about the library.</p>\n<p>Coming from Rails world with some jQuery flavour in the front end, events\nwere not a huge deal for me. I never really worried about events in the Rails\nside. Even on the front end, I used events in jQuery very limitedly.</p>\n<p>On the other hand in Backbone, events are extremely important and useful.\nIt helps you to write simpler and modular code. Less if-else spaghettis and\nchained up functions calling some other functions and so on. With events, even\nif one thing falls down, the other part that depends on the event still won't\nfall apart.</p>\n<p>At the same time though, you can still create a mess when events are chain up\ntogether. I find the debugging sometimes is harder with event driven code\nbecause the links between different parts of the code are not explicit anymore.\nA new coder diving into the pre-existing backbone.js codebase will have\nsome trouble understanding how different parts of the code are working together.\nThis is because there's less if-else, and explicit chains of functions to\nindicate how different codes are working together.</p>\n<p>Backbone.js does help you to writing cleaner code. Having more structured js code\nwith models, views and routes definitely make the code more understandable.\nBut it seems as though, there's no perfect guard against shitty code.\nI still saw myself writing junk and memory hogging code. Rendering a page\nmultiple times needlessly and making unnecessary ajax calls to server slowing\nthe page down. So you still to me mind the performance can be hit using\nbackbone.js.</p>\n<p>Backbone.js often comes with many other tools to learn about.</p>\n<ul>\n<li>require.js for loading modules</li>\n<li>marionette.js for giving more structure and proving commonly used functions in backbone</li>\n<li>handlebars.js for templating</li>\n<li>underscore.js for useful functions on arrays, collections, and misc. js objects</li>\n<li>jquery for dom manipulation and ajax</li>\n</ul>\n<p>I also started using:</p>\n<ul>\n<li>yeoman for setting up app dev environment</li>\n<li>grunt.js for automating repetitive tasks</li>\n<li>npm and bower for managing js packages</li>\n</ul>\n<p>I noticed that doing something I would consider to be really easy to do in\nRails were more complicated and not straight forward. Stuff like global\nvariables, view helpers, partial views etc were all doable in backbone, but\nthere's always more than one way to do things in backbone. That makes things hard for\nnewcomers.</p>\n<p>Overall, my adventure in backbone.js is turning out to be a very fruitful one.\nI am learning a lot fast and I can't wait to dig deeper into backone and maybe\ntry out other frameworks like Angular and Ember more seriously.</p>\n"}},"__N_SSG":true}