{"pageProps":{"post":{"title":"Buying a Used Car in Seattle","createdAt":"2014-10-16T00:00:00-07:00","categories":["car"],"slug":"buying-a-used-car-in-seattle","fullPath":"/Users/jasonkim/projects/websites/serv.github.io/_posts/2014-10-16-buying-a-used-car-in-seattle.md","content":"<h2>tl;dr</h2>\n<p>I bought 2009 Pontiac Vibe GT after researching new and used cars for close to a year.\nBuying a used car from a private seller is more complicated than buying a new car or\na used car from a dealer, but you will probably get a better deal.</p>\n<p><img src=\"http://i.imgur.com/D3CfyMT.jpg\"></p>\n<p>I finally got a car! I wanted one for a long time, but it never really made sense financially\nuntil now. The car I got is 2009 Pontiac Vibe GT with about 86,000 miles.\nI got a pretty good bargain on the car and I am really pleased with the purchase.\nAs a celebratory act, I went to get a large load of grocery. Thinking back at\nthe college days when I had to get grocery in -20 celcius Canadian winter with\nsnow coming up to my ankle, I am so happy where I am right now.</p>\n<h2>Do I actually need a car?</h2>\n<p>After finding a real job in Seattle in 2012, the first thing that came to my\nmind was thinking about buying a car. I dreaded having to go outside in Waterloo,\nCanada during the winter because it was so damn cold. When I think back, I really\ncould've used a car then. Even a really shitty one would've done the job.\nBut when I got to Seattle, for a while I was living in Belltown. It's a neighbourhood,\nright near by the downtown Seattle where my work was. I could walk for 15 minutes\nand I was get to my work. I didn't need a car at all then. I decided against it.</p>\n<p>A few months after, I started making some friends in Seattle. A few times I hung\nout with them, I really enjoyed meeting them. I wanted to meet them more. But\nmany of my Seattle friends were living in South Seattle. It's a long way out\nfrom where I am now, and it's a major pain in the neck to take transit there.\nSo I got around by asking for rides here and there. My friends never minded\ngiving me a ride, but I felt bad and grateful at the same time for their offer.\nI now had a reason I wanted to get a car.</p>\n<p>This was a strong reason that pushed me to start the research, but it wasn't big\nenough of an incentive to push me to actually act. I would browse Craigslist\nand Trucars.com occasionally, but I never really made a real attempt to purchase\na car yet. However, I would learn about another reason why I wanted a car. I went\nto <a href=\"http://www.yelp.com/biz/snow-lake-north-bend\">Snowlake</a>.</p>\n<p><img src=\"http://i.imgur.com/2tNF1LG.jpg\"></p>\n<p>It was a beautiful place. I was shocked that I had missed out on such an amazing\nsight simply because I didn't have a car to drive there. I swore to myself that\nwhen I get a car, I would drive around the Northwest and enjoy the awesome mountains\nand coastlines.</p>\n<p>Lastly, I realized I am simply wasting too much time by taking transit. Yes, it\nis true that I am saving money, but not driving, but at what cost and the loss\nof time? It was a no brainer now. I needed a car.</p>\n<h2>What car?</h2>\n<p>I considered small Asian made cars. Brands like Toyota, Honda, Hyundai, Nissan and Kia\nwere brands I closely looked at. Compact cars like Corolla, Civic and Elantra\nwere the car I was interested in the most. I just wanted a car that eats up\nlittle gas and gets me from A to B. Reliability is also important. I needed a car\nthat will run with just regular maintenance and little to no issues.</p>\n<p>I considered both new and used car. I preferred used cars because I was hoping\nthat I could get a car that's cheaper while giving more value. But as I was\nbrowsing more used cars, it was increasingly clear that Seattle is a terrible\nplace to buy a used car. Compared to other parts of the country, Seattle used\ncars were consistently more expensive. For this reason, I started to check out\nnew cars.</p>\n<p>I went to Honda and Toyota dealers near Seattle downtown area. They were both\nhelpful but I couldn't help feeling that something felt off. Especially the Honda\ndealer was less trust worthy. The day before I wanted to visit the Honda dealer,\nI called to make sure that I wanted to have a look at used Kia Forte hatchback.\nThe call was made at around 8pm. The salesman was saying that I can come and have\na look the next day. When I went early in the morning next day, he told me that\nthe car was sold right after my call, late at night. I was thinking to myself,\nhow stupid do they think I am? I was done with dealing with car dealers.</p>\n<h2>Buying a used car from a private seller</h2>\n<p>Although I am writing about this section rather briefly, it was a pretty lengthy\nprocess. It took me around a year to go from researching to purchasing a car mostly\nbecause I felt that I didn't need one immediately. I took time to see what cars of\ndifferent year and miles cost how much usually. This helped me greated in determining\nwhat's a good deal and what is no so good. I mistakenly delayed my action in purchasing\na car and missed a few really good deals.\nI also got baited by deals that are too good to be true and wasted my time emailing\nthem.</p>\n<p>Last Saturday, I spotted a red 2009 Pontiac Vibe GT on craigslist.\nIt was auto, only had 86k miles which isn't too bad.\nThe asking price was $9059. I was interested.\nI emailed the seller for a carfax of the vehicle and the seller sent it to me\nimmediately. This was a good sign. I knew that this seller would be good to\nwork with.</p>\n<p>I called her to see if she'd be available for me to drive the car.\nWe agreed that I would meet each other in downtown the next day.\nI looked around the car and test drove the car in the downtown area.\nI tried out steep uphills as well, and Vibe handled it with ease. I didn't\ngo on a highway which I should've but I wasn't prepared to drive someone else's\ncar on a highway. At the end of the test run, I asked the seller to arrange\na used car inspection with a mechanic. She agreed to do it.</p>\n<p>The 2 days after the test run, we both met again during the mechanic's inspection\nof the car. The mechanic also had a Pontiac Vibe serendipitously. Inspection\nwent smoothly only discovering a cosmetic damage on the car which she fixed later.\nAfter the car was inspected, I agreed to purchased the car and I decided that\nI would pay by cashier's cheque. She was fine with that.</p>\n<p>The next day, we met at the downtown Seattle DOL office and signed the\ntitle transfer paper, bill of sales and odometer reading paper. The clerk at the\noffice was very helpful in guiding us through the process. I paid around $950\non sales tax and WA registration fee, and all was good.</p>\n<p>Feel free to comment if you have any question purchasing a used car in WA.</p>\n"}},"__N_SSG":true}