{"pageProps":{"post":{"title":"What I was doing before computers","createdAt":"2014-07-14T00:00:00-07:00","categories":["random"],"slug":"what-i-was-doing-before-computers","fullPath":"/Users/jasonkim/projects/websites/serv.github.io/_posts/2014-07-14-recount.md","content":"<h2>tl;dr</h2>\n<p>I am recounting of how I spent time before I had a computer.</p>\n<h2>Before computers</h2>\n<p>Long before I had a computer, I had several types of toys I gravitated to.\nRobots figures! Damn, those were cool. I didn't like them for a long time\nthough. Far too often, different parts of the robot will break and I\nwould soon get bored of them. I also like toy cars a lot. One time when my dad\nwent to LA for work, he brought home <a href=\"http://en.wikipedia.org/wiki/Hot_Wheels\">Hot Wheals</a>.\nI remember making rambunctious engine noises and racing the cars with my hand.\nThey were really fun, but I lost them easily. These small toy cars were\nincredibly susceptible to going under different furnitures around the house\nand I lost some of them one by one.</p>\n<p>There were several others I liked, but there were mostly fads for me.\nBut there was one type of toy that stuck with me for years.</p>\n<h2>Lego</h2>\n<p>I played with Legos for years. When I think about it, I think legos were\nsomething I played with for the longest time besides computers. I don't think\nI really thought about why I liked Legos so much when I was playing with them\nat that age. However, it's clear to me that I really enjoyed building things\nin retrospect. It could've been that Legos were one thing I had some control over\nin my life. Remember, this was when I was told when I to go to bed, what I had to eat,\nwhen I had to wash myself and do all other trivial shit.</p>\n<p>Lego was the god-mode sandbox. I spent a lot of time making cool stuff, ugly stuff,\nweird stuff and all kinds of random things. One thing I didn't do with lego\nwas following the instruction. I never bothered with them. Not only was I too\nimpatient to follow them (if I was raised in US, I was probably diagnosed as ADD),\nI found no fun in following the instruction. Sure, it looked impressive to\nother friends, but what fun is it if I had to keep the same structure the whole\ntime without being able to build something else?</p>\n<p>Legos were really really big in Korea during 90s. I remember one year, when half\nthe boys in my class had the same kit called, <a href=\"http://pockgoon.egloos.com/3701611\">Lion Castle, in Korean, 사자성</a>.\nIf I remember correctly, I think this kit was easily over 100,000 won in Korea, which\nis roughly \\$100 in US, so it is not a small purchase, especially for Koreans\nin 90s.\nOne of my best friends then had also bought it. I didn't. I remember\nbegging my parents for it, but one thing I remember is that they never\ngave into me begging. They didn't budge an inch. This was the most impressive\nLego kit I've seen until then. For the first time, I wanted to follow the\ninstruction to build it.</p>\n<p>I pretty much stopped playing with Legos abruptly when I moved to Hong Kong.\nThe delivery company DHL (I still remember!) lost a box that contained my lego.\nThat was it with my legos. I longed for legos still, but that quickly faded\nwhen I was introduced to a game called Starcraft by my Kumon math tutor. But\nI'll save that for later.</p>\n<h2>Playground</h2>\n<p>Korea was a weird place to be during the 90s. Not everyone were well off, but\nthe kind of poverty people experience just a few decades ago was almost\ncompletely gone. There was a huge surge of optimism that things will get better\nand progress was simply inevitable. Of course, I am speaking of pre-late 90s\nAsian economic collapse here. Things got dark quickly, but again, I'll leave this\nbit for later.</p>\n<p>I don't know about Korea too much now, but apparently, there aren't kids in playgrounds\nanymore. Kids in general are less common nowadays in Korea. Korea now has the\n<a href=\"https://www.cia.gov/library/publications/the-world-factbook/rankorder/2127rank.html\">5th lowest fertility rate in the world</a>.\nKids are probably stuck at home on computers these days.</p>\n<p>90s probably marked the last generation of kids playing in playground.\nSo many kids knew each other just being around the playground.\nIn most cases, kids got along well. There were some bullies, but they were rare.\nWe played soccer in small fields and jump off tall slides and swings in mid air.\nIf I tried any of those now, I'll probably break a few bones here and there.</p>\n<p>I will dearly miss the <em>good ol' days</em>.</p>\n"}},"__N_SSG":true}