{"pageProps":{"post":{"title":"Making Bubble","createdAt":"2014-06-05T00:00:00-07:00","categories":["mobile app"],"slug":"making-bubble","fullPath":"/Users/jasonkim/projects/websites/serv.github.io/_posts/2014-06-05-making-bubble.md","content":"<p>##tl;dr</p>\n<p>I worked on chat/photo sharing app called <a href=\"http://app-bubble.com\">Bubble</a>\nwith 4 others. We won the runner-up for\njudge's choice award in [University of Washington's\nHCDE Capstone &#x26; Research Showcase].</p>\n<p><img src=\"http://i.imgur.com/Rre9eGu.jpg\"></p>\n<hr>\n<p>I worked with 4 masters students from UW's HCD program to build a photo sharing\nchat app with a <em>shocking</em> twist. The twist is that the app does not need\ninternet connection to work. The app is called <a href=\"http://hcdeevee.tumblr.com/\">Bubble</a>.</p>\n<p>We started working together in January 2014. We began\nwith brainstorming what kind of thing we wanted\nto work with. We literally could not gauge what each\nof us were interested in. So we threw together a dozen\nsomething ideas and we narrowed down to a vague\nlocation check-in app. The idea didn't stop evolving there. We continued to carve\nand morph the idea. Eventually the app turned out to be\nsomething completely unexpected.</p>\n<p>Bubble is a chat/photo sharing app that doesn't\nrely on internet connection.</p>\n<p>Back in 2009 when I used to commute to my work to Merrill Lynch\nin Toronto, I felt incredibly bored in the subway.\nI had a old school flip phone, so I couldn't do much,\nbut I had unlimited text and I would text a lot.\nBut in the subway without any connection, I was left\ndoing nothing. There and then, I was thinking to myself\nhow awesome it would be to still be able to chat\nwith others without having signal. I thought of\nsome sort of mesh network then. Decentralized, ad-hoc\nnetworks that could be created anywhere. I also\nimagined a world where companies like Rogers and Bell\nwere irrelevant forces in telecommunication. So this\nidea of complete decentralized network captured\nmy wild imaginations.</p>\n<p>Fast forward to 2014, I learned that iOS has the\nprecise capability to do this. I didn't really let\nmy team know, but it was an amazing feeling. I was\nfinally working on something that I only dreamed of\nonly a few years ago. And this app I was working on\nwasn't just for chat, it could also send photos. The\nidea was infatuating. The app was gold.</p>\n<p>I will continue to work on the app to see it in the AppStore.\nI can't wait for that moment to come.</p>\n<p><img src=\"http://i.imgur.com/ADoh5P6.jpg\"></p>\n"}},"__N_SSG":true}