{"pageProps":{"post":{"title":"Time Saving Tips for Software Development for Developers","createdAt":"2016-04-09T00:00:00-07:00","categories":["software development"],"slug":"time-saving-tips-for-software-development-for-developers","fullPath":"/home/jason/projects/websites/serv.github.io/_posts/2016-04-09-software-development-time-saving.md","content":"<p>I waste a lot of time not coding. Typical work involves many activities,\nthat are process related chores, meetings and etc, so only a fraction of time\ncan be spent on coding and working on a feature. I find it important that\nyou should try to squeeze most out of this time as possible.</p>\n<p>I try to understand the product feature and its use cases before I begin\ncoding on a feature.\nIn an ideal world, your product owner will write a perfect story that\ndoesn't require any edits whatsoever. This never happens. Product owners are\nhumans and they will usually write an insufficient story\nwhen the stories are sufficiently large and complicated.\nDevelopers must be able to wear the product owner's hat to come up with the\nrest of the acceptance requirements for a story.\nTry to come up with what makes sense and what doesn't make sense about the\nstory. While you are trying to come up with what makes sense,\nbring it up with your product owner to see if some additional acceptance\ncriteria needs to be added. When things don't make sense in the story, also\nbring it up with product owner sooner rather than later.</p>\n<p>Here's another thing I do before I begin coding.\nI spend a good length of time thinking about the software design of the feature.\nExplore how each acceptances in the story can be mapped to your software design.\nYour code builds on top of other code you wrote.\nCode you write has inertia. Early on during the coding phase, you can make\nsmall and large changes without much trouble. You are nimble when your code\nfor the feature isn't large yet. But when you have to change the software design\nlater on down the road, changing your existing code that has grown larger\nis way more difficult. There are many more moving parts and each changes\nyou have to make in your code will need to make multiplicative changes across\nyour code base. Also engage your teammates in brainstorming session and\npick their brains on how they think the code should look.</p>\n<p>After you are completed with coding, have a rigorous code review with your\ncoworker. I was wrong about this before. I have been doing more lenient\ncode review that left quite a room for disagreement. Be respectful in your\ntone and watch out for strong language. Messages do not get understood\nbest over the web, especially when that message is about criticizing your code.\nThis code review should be contrasted with nitpicking. It's not about trying\nto inject your preference for the code. It should be about writing good code.</p>\n"}},"__N_SSG":true}