{"pageProps":{"post":{"title":"Try Not To Break The Back Button","createdAt":"2014-02-22T00:00:00-08:00","categories":["mobile web"],"slug":"try-not-to-break-the-back-button","fullPath":"/home/jason/projects/websites/serv.github.io/_posts/2014-02-22-try-not-to-break-back-button.md","content":"<p>I come across websites that break the Back button too often for bad reasons.\nBack button is one of the longest living orthodoxies in web people take for\ngranted, and rightly so.</p>\n<p><img src=\"http://i.imgur.com/3FAYPf6.png?1\" alt=\"back\"></p>\n<p>Back button is useful. It serves its purpose for navigation so perfectly that\nthere's been little to no change done it for decades. Phones subsequently\nadopted it without modifying what it does that much. Back button remains\nuseful in mobile browser even more so because other kinds of precise actions\nrequire so much more effort to pull off. Most users resort to the back button\nfor most of rudimentary navigations.</p>\n<p>Back button gets broken with using <code>window.location</code> which will redirect the page to the address that <code>window.location</code> set to.</p>\n<h2>Anatomy of Broke Back Button</h2>\n<p><img src=\"http://i.imgur.com/KBSu4K3.jpg\" alt=\"location\"></p>\n<ol>\n<li>User is on page A.</li>\n<li>User clicks on a link and goes to B.</li>\n<li>B has <code>window.location</code> set to page C.</li>\n<li>User is finished with the page C, and wants to return to A.</li>\n<li>User clicks back.</li>\n<li>User is back to B, and is immediately redirected to C again.</li>\n</ol>\n<p>There are some ways to mitigate the problem.</p>\n<ul>\n<li>Use redirect with countdown so that the user can get a chance to click\nback button again, while the countdown happens.</li>\n<li>If the redirect is to a mobile site for mobile users, try building\nadaptive or responsive site that doesn't require rediecting the user to a\nnew site</li>\n<li>Use a gentle call to action that prompts user to the mobile, instead of\na silent redirect.</li>\n</ul>\n<p>Not breaking the default behaviour of the back button is a general rule of\nthumb. I am sure there are times, when you must end up breaking the back\nbutton for a bigger gain. :)</p>\n"}},"__N_SSG":true}