{"pageProps":{"post":{"title":"Unfortunate State of Mobile Web","createdAt":"2014-02-20T00:00:00-08:00","categories":["mobile web"],"slug":"unfortunate-state-of-mobile-web","fullPath":"/home/jason/projects/websites/serv.github.io/_posts/2014-02-20-unfortunate-state-of-mobile-web.md","content":"<p>##tl;dr</p>\n<ul>\n<li>Mobile web sucks and mobile native apps are way better.</li>\n<li>HTML5 is not a Messiah.</li>\n<li>no one is really interested in making mobile web better.</li>\n</ul>\n<p>Imagine that we are in 2020, 6 years away from now.</p>\n<p>We wouldn't have quite gone boldly where no man had gone before in our\nuniverse, but we would have at least explored mobile experience tirelessly\nby then. Thousands of photos apps would have been made. WhatsApp copies\nwould have iterated upon iterations. First there was Angry Bird, then\nFlappy Bird, then some more Angry Flappy Birds. Dead horses would be beaten\nmore than one can count. So much would have changed and improved, but one\nthing still remains the same. Mobile web experience will likely still lag behind the native app experience.</p>\n<p><img src=\"http://i.imgur.com/91gZqO4.png\" alt=\"html5-op\"></p>\n<p>Inability of browsers to take advantage of phone hardware has been stated\nas a reason why mobile web is lagging behind the native app. But I cast\nmy skepticism cautiously.</p>\n<p><a href=\"https://developer.mozilla.org/en-US/docs/Web/Guide/HTML/HTML5\">Changes in HTML5</a>\nin recent years have been absolutely mind blowing.\nYou can replicate native\napp experience on browser (though it is not easy). HTML5 in many ways have\ncaught up to where native apps are right now. Optimization on browser for\nmobile still remains as a difficult task, but so is developing for\nnative app. So what is dragging mobile web experience down?</p>\n<h2>A Vicious Cycle</h2>\n<p><img src=\"http://i.imgur.com/GM4tFzI.jpg\" alt=\"cycle\"></p>\n<p>Mobile web development process is in a gridlock that continues to worsen\nmobile web. The incentives for users, management and developers are all\nuniformly against mobile web. Users have a preconceived notion that mobile\nweb sucks, and this belief is justified. It sucked for a long time, and even\ntoday, it's not that great. Software companies are aware of this consensus\nand devote less time and developer resources into making mobile web\nexperience better. Mobile space for native apps, they say.\nWeb developers return the favor by creating a web app\nthat barely meets the minimum expectations set by the management. I want\nweb to win, but I am not optimistic about it.</p>\n<p>Mobile web is suffering from a great stagnation. Effectively distributing\nmobile web app to users are practical non-existent. Lack of standardized\nmonetization scheme hinders any development effort in mobile web. Much of\nthe web still remains apathetic to mobile users. Discovery process of mobile\nweb? What discovery process? And mobile web still feels clunky, slow and\noff-beat. Mobile web experience is years behind native app experience. In\nthe age when a year represents an eternity of changes and improvements,\nmobile web will not be able to attract users from native app for another few\nyears.</p>\n"}},"__N_SSG":true}