{"pageProps":{"post":{"title":"Tips for Transitioning to a New Team or a New Job","createdAt":"2016-11-13T00:00:00-08:00","categories":["career"],"slug":"tips-for-transitioning-to-a-new-team-or-a-new-job","fullPath":"/Users/jasonkim/projects/websites/serv.github.io/_posts/2016-11-13-starting-a-new-job-or-transitioning-to-a-new-team.md","content":"<p>I recently had to transition to a web team from an API team at work.\nIt was a difficult transition, but overall, it's a transition that I\nam really happy about. I like the new team and the new learning\nopportunities transitioning to a new team allows me.\nI bet starting a new job probably results in a similar situation, but\nwith a bigger scope of new work to learn about. Here are some tips\nfor someone who's starting a new job or transitioning to a work\nthat will help you to get use to the new tasks as a software engineer.</p>\n<h2>1. Learn the directory structure of the codebase</h2>\n<p>Learning 100% of the codebase in a short period of time is difficult.\nThis can be made easier by having someone explain the directory\nstructure of the codebase for you. Once you understand the context\nof the directory sturcture, smaller parts of the codebase can be\nmade more sense easier.</p>\n<h2>2. Ask questions to the teammembers</h2>\n<p>You have the experts of the codebase sitting around you. Ask them\nquestions and get the answers you need.\nHave the questions be about things that you can't figure out on\nyour own. For example, questions about codebase can be figured\nout on your own with some struggles, but questions about how\nAkamai cache is set up, how deployment works, how testing works,\nhow oncall process works, etc can't be figured out on your own.\nSo for these things, you have ask questions.</p>\n<h2>3. Have a vision</h2>\n<p>You should have a vision for your own work aside from the day\nto day work at the team. This was a better advice I've received\nfrom a coworker, and he is right. Doing your day to day job well\nmakes you a good engineer. If you have a vision about the project\nyou work on and attempt to improve the product with a vision,\nyou can be a great engineer. You have to ensure that your vision\nis aligned with the product vision, team vision and the company\nvision.</p>\n"}},"__N_SSG":true}